# RenderingImageExposureSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RenderingImageExposureSettings Properties
RenderingImageExposureSettings Class See Also
---
The RenderingImageExposureSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExposureValue | The value of rendering image exposure. |
| Highlights | The highlights value. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Saturation | The value of rendering image saturation. |
| Shadows | The shadows value. |
| WhitePoint | The white point value. |

# See Also
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace